Revit 2027 API
IFCAnyHandle.Equality Operator
Determines whether two IFCAnyHandles are the same.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	IFCAnyHandle first,
	IFCAnyHandle second
)
Public Shared Operator = (
	first As IFCAnyHandle,
	second As IFCAnyHandle
) As Boolean
public:
static bool operator ==(
	IFCAnyHandle^ first,
	IFCAnyHandle^ second
)
static let inline (=)
        first : IFCAnyHandle *
        second : IFCAnyHandle  : bool
Parameters
first IFCAnyHandle
The first IFCAnyHandle.
second IFCAnyHandle
The second IFCAnyHandle.
Return Value
Boolean
True if the IFCAnyHandles are the same; otherwise, false.
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace